// ------------------------------------------------------------------------------
// name: index
// author: mudas( mschool.tech )
// created: 2019/11/14 17:21
// ------------------------------------------------------------------------------

import * as Module from './module';

// --------------------------------------------------------------------------
// 应用启动
// --------------------------------------------------------------------------
export const LAUNCH_QR = `${Module.LAUNCH}/getShopQrInfo`;
export const LAUNCH_SHOP = `${Module.LAUNCH}/getShopInfoByAppId`;

// --------------------------------------------------------------------------
// 环境信息
// --------------------------------------------------------------------------
export const ENV_PARAMS = `${Module.ENV}/params`; // url 参数和启动参数
export const ENV_CONFIG = `${Module.ENV}/config`; // 应用配置参数
export const ENV_SYSTEM = `${Module.ENV}/system`; // 系统参数信息
export const ENV_RESET = `${Module.ENV}/reset`; // 重置应用配置参数（解决一般小程序重新打开会缓存保留上一次的启动参数）

// --------------------------------------------------------------------------
// 用户信息
// --------------------------------------------------------------------------
export const USER_INFO = `${Module.USER}/user-info`; // 用户信息
